config.org
#+title: Config
#+author: Gerald Lee Yurek III
#+email: g3@yurek.me
#+options: toc: 3 headlines: 4
#+startup: nohideblocks

* :TOC:
- [[#configel][Config.el]]
  - [[#emacs-specific-kinda][Emacs Specific (kinda)]]
  - [[#cosmetic-changes-more-doom-specific][Cosmetic Changes (More Doom Specific)]]
  - [[#org-mode][Org mode]]
  - [[#dired][Dired]]
  - [[#lisp][Lisp]]
  - [[#emailmu4e][Email/Mu4e]]
  - [[#which-key][Which Key]]
  - [[#elpher][Elpher]]
  - [[#ligatures][Ligatures]]
- [[#packageel][Package.el]]
  - [[#org-journal][Org Journal]]
  - [[#ligatures-1][Ligatures]]
  - [[#dired-open][Dired Open]]
  - [[#dired-subtree][Dired Subtree]]
  - [[#peep--dired][Peep  Dired]]
  - [[#elpher-1][Elpher]]

* Config.el
** Emacs Specific (kinda)
*** REGISTERS
- Stolen from https://gitlab.com/dwt1/dotfiles/-/blob/master/.config/doom/config.org
Emacs registers are compartments where you can save text, rectangles and positions for later use. Once you save text or a rectangle in a register, you can copy it into the buffer once or many times; once you save a position in a register, you can jump back to that position once or many times.  The default GNU Emacs keybindings for these commands (with the exception of counsel-register) involves 'C-x r' followed by one or more other keys.  I wanted to make this a little more user friendly, and since I am using Doom Emacs, I choose to replace the 'C-x r' part of the key chords with 'SPC r'.

| COMMAND                          | DESCRIPTION                        | KEYBINDING |
|----------------------------------+------------------------------------+------------|
| copy-to-register                 | /Copy to register/                 | SPC r c    |
| frameset-to-register             | /Frameset to register/             | SPC r f    |
| insert-register                  | /Insert contents of register/      | SPC r i    |
| jump-to-register                 | /Jump to register/                 | SPC r j    |
| list-registers                   | /List registers/                   | SPC r l    |
| number-to-register               | /Number to register/               | SPC r n    |
| counsel-register                 | /Interactively choose a register/  | SPC r r    |
| view-register                    | /View a register/                  | SPC r v    |
| window-configuration-to-register | /Window configuration to register/ | SPC r w    |
| increment-register               | /Increment register/               | SPC r +    |
| point-to-register                | /Point to register/                | SPC r SPC  |

#+BEGIN_SRC emacs-lisp
(map! :leader
      (:prefix ("r" . "registers")
       :desc "Copy to register" "c" #'copy-to-register
       :desc "Frameset to register" "f" #'frameset-to-register
       :desc "Insert contents of register" "i" #'insert-register
       :desc "Jump to register" "j" #'jump-to-register
       :desc "List registers" "l" #'list-registers
       :desc "Number to register" "n" #'number-to-register
       :desc "Interactively choose a register" "r" #'counsel-register
       :desc "View a register" "v" #'view-register
       :desc "Window configuration to register" "w" #'window-configuration-to-register
       :desc "Increment register" "+" #'increment-register
       :desc "Point to register" "SPC" #'point-to-register))
#+END_SRC


*** Calendar
#+begin_src emacs-lisp
;; https://stackoverflow.com/questions/9547912/emacs-calendar-show-more-than-3-months
(defun dt/year-calendar (&optional year)
  (interactive)
  (require 'calendar)
  (let* (
      (current-year (number-to-string (nth 5 (decode-time (current-time)))))
      (month 0)
      (year (if year year (string-to-number (format-time-string "%Y" (current-time))))))
    (switch-to-buffer (get-buffer-create calendar-buffer))
    (when (not (eq major-mode 'calendar-mode))
      (calendar-mode))
    (setq displayed-month month)
    (setq displayed-year year)
    (setq buffer-read-only nil)
    (erase-buffer)
    ;; horizontal rows
    (dotimes (j 4)
      ;; vertical columns
      (dotimes (i 3)
        (calendar-generate-month
          (setq month (+ month 1))
          year
          ;; indentation / spacing between months
          (+ 5 (* 25 i))))
      (goto-char (point-max))
      (insert (make-string (- 10 (count-lines (point-min) (point-max))) ?\n))
      (widen)
      (goto-char (point-max))
      (narrow-to-region (point-max) (point-max)))
    (widen)
    (goto-char (point-min))
    (setq buffer-read-only t)))

(defun dt/scroll-year-calendar-forward (&optional arg event)
  "Scroll the yearly calendar by year in a forward direction."
  (interactive (list (prefix-numeric-value current-prefix-arg)
                     last-nonmenu-event))
  (unless arg (setq arg 0))
  (save-selected-window
    (if (setq event (event-start event)) (select-window (posn-window event)))
    (unless (zerop arg)
      (let* (
              (year (+ displayed-year arg)))
        (dt/year-calendar year)))
    (goto-char (point-min))
    (run-hooks 'calendar-move-hook)))

(defun dt/scroll-year-calendar-backward (&optional arg event)
  "Scroll the yearly calendar by year in a backward direction."
  (interactive (list (prefix-numeric-value current-prefix-arg)
                     last-nonmenu-event))
  (dt/scroll-year-calendar-forward (- (or arg 1)) event))

(map! :leader
      :desc "Scroll year calendar backward" "<left>" #'dt/scroll-year-calendar-backward
      :desc "Scroll year calendar forward" "<right>" #'dt/scroll-year-calendar-forward)

(defalias 'year-calendar 'dt/year-calendar)
#+end_src
*** Garbage Collector
Just to give the garbage collector since my computer has enough ram to accommodate
that many bytes before having to invoke the garbage collector
#+begin_src emacs-lisp

(setq gc-cons-threshold 50000000)

#+end_src

*** Tabs/Spaces
This is a futile attempt at trying to change the tab config
I am not that good yet at emacs lisp nor emacs itself
#+begin_src emacs-lisp

(setq-default tab-width 4
              ;; tab-always-indent 'complete
              indent-tabs-mode t)

#+end_src

*** Set the clangd bianary location because nixos
#+begin_src emacs-lisp
(setq lsp-clangd-binary-path "/nix/store/xwnhwdqck5c5x7xddgj2vcrdjd274b3z-system-path/bin/clangd")
#+end_src
*** Spell program
#+begin_src emacs-lisp

(setq ispell-program-name "aspell")

#+end_src
*** Encoding system
ASCII is a inferior encoding system to UTF-8, there is no reason not to use UTF-8
when there are no drawbacks to using UTF-8
#+begin_src emacs-lisp

(set-language-environment "UTF-8")
(set-default-coding-systems 'utf-8)

#+end_src

*** Info for git and email
Set my name and username for git reasons, or what else needs these things
#+begin_src emacs-lisp

(setq user-full-name "Gerald Lee Yurek III"
      user-mail-address "g3@yurek.me")

#+end_src
*** Fix my OCD urges
The are a select few things that happen at startup or when a command is called
things like opening a message log, compile log, async compile log, a scratch buffer at startup
**** Make initial scratch message empty
#+begin_src emacs-lisp

(setq initial-scratch-message "")

#+end_src

**** Remove the scratch buffer after the mode has been set
I don't think I have ever used a scratch buffer effectively, neither have I
wanted to
#+begin_src emacs-lisp

(defun remove-scratch-buffer ()
  (if (get-buffer "*scratch*")
      (kill-buffer "*scratch*")))

(add-hook 'after-change-major-mode-hook 'remove-scratch-buffer)

#+end_src

**** Close Native compile logs
Because I use GCC-Emacs, the log comes up and I must close it.
It also took a good long while for me to discover the second line variable
#+begin_src emacs-lisp

(add-hook 'native-comp-limple-mode-hook 'kill-buffer "*Native-compile-Log*")
(setq-default native-comp-verbose 0)

;;insurance policy
(if (get-buffer "*Native-compile-Log*") (kill-buffer "*Native-compile-Log*"))
(if (get-buffer "*Async-native-compile-log*") (kill-buffer "*Async-native-compile-log*"))

#+end_src

**** Prevent Messages buffer from existing
#+begin_src emacs-lisp

(setq-default message-log-max nil)
;; (kill-buffer "*Messages*")

;;insurance policy
(if (get-buffer "*Messages*") (kill-buffer "*Messages*"))

#+end_src

**** Prevent async compilation log
#+begin_src emacs-lisp

(setq-default comp-async-report-warnings-errors nil)

#+end_src

**** Prevent completions buffer when I don't need it
Removes from buffer after file is opened
#+begin_src  emacs-lisp

(add-hook 'minibuffer-exit-hook
	  '(lambda ()
	     (let ((buffer "*Completions*"))
	       (and (get-buffer buffer)
		    (kill-buffer buffer)))))
#+end_src

**** Don't show *Buffer list* when opening multiple files at the same time.
#+begin_src emacs-lisp

(setq inhibit-startup-buffer-menu t)

;; Show only one active window when opening multiple files at the same time.
;; (add-hook 'window-setup-hook 'delete-other-windows)

#+end_src



** Cosmetic Changes (More Doom Specific)
*** Dashboard
Various changes mostly slight tweaks to the built in dashboard provided by doom-emacs
