config.org
**** ASCII Banner
Changing the doom dashboard banner because I like this one better
We are going to gloss over the fact that I "Borrowed" this entire section from a
blog minus the logo, that we a figlet font I modified with a underline throughout
the word.
#+begin_src emacs-lisp

(defun doom-dashboard-draw-ascii-emacs-banner-fn ()
  "This figlet font is called broadway"
  (let* ((banner
      '("                                                              .         .          "
        "888888888o.          ,o888888o.         ,o888888o.           ,8.       ,8.         "
        "8888    `^888.    . 8888     `88.    . 8888     `88.        ,888.     ,888.        "
        "8888        `88. ,8 8888       `8b  ,8 8888       `8b      .`8888.   .`8888.       "
        "8888         `88 88 8888        `8b 88 8888        `8b    ,8.`8888. ,8.`8888.      "
        "8888          88 88 8888         88 88 8888         88   ,8'8.`8888,8^8.`8888.     "
        "8888          88 88 8888         88 88 8888         88  ,8' `8.`8888' `8.`8888.    "
        "8888         ,88 88 8888        ,8P 88 8888        ,8P ,8'   `8.`88'   `8.`8888.   "
        "8888        ,88' `8 8888       ,8P  `8 8888       ,8P ,8'     `8.`'     `8.`8888.  "
        "8888    ,o88P'    ` 8888     ,88'    ` 8888     ,88' ,8'       `8        `8.`8888. "
        "888888888P'          `8888888P'         `8888888P'  ,8'         `         `8.`8888."
        "   _____________________________________________________________________________   "
        ".o8888888888888888888888888888888888888888888888888888888888888888888888888888888o."
        "                                                                                   "))

     (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
        +doom-dashboard--width
        (concat
         line (make-string (max 0 (- longest-line (length line)))
                   98)))
           "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'doom-dashboard-draw-ascii-emacs-banner-fn);)

#+end_src

**** Changing the Faces/Colors of text
The default colors for the dashboard are nice, they are set to Gruvbox, but they
aren't in the /dialect/ or implementation of colors in certain places are not
to my personal spec
#+begin_src emacs-lisp

(custom-set-faces!
  '(doom-dashboard-banner :foreground "#d79921" )
  '(doom-dashboard-footer :foreground "#b16286")
  '(doom-dashboard-footer-icon :foreground "#689d6a")
  '(doom-dashboard-loaded :foreground "#b8bb26")
  '(doom-dashboard-menu-desc :foreground "#83a598" )
  '(doom-dashboard-menu-title  :foreground "#fb4934")
  '(doom-modeline-time :foreground "#458588"))
(setq doom-gruvbox-dark-variant "medium")
#+end_src

#+RESULTS:
: soft

*** Change doom-font
#+begin_src emacs-lisp

(setq doom-font (font-spec :family "Fira Code" :size 14))
(setq doom-unicode-font (font-spec :family "Fira Code" :size 14))

#+end_src


*** Change doom-theme
Me personally I am a Gruvbox enthusiast, My wm, text editor(s), terminal, mail
client, and primary web browser are examples of this.
#+begin_src emacs-lisp

(setq doom-theme 'doom-gruvbox)

#+end_src

*** Line numbers are non-negotiable
I can't live without line numbers, especially for the inevitability of a compile
error.
#+begin_src emacs-lisp

(setq display-line-numbers-type t)

#+end_src

*** Modeline
#+begin_src emacs-lisp

(setq doom-modeline-time t
      doom-modeline-height 11
      doom-modeline-buffer-name t
      doom-modeline--battery-status t)
(setq doom-modeline-enable-word-count t
      doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode))
(display-battery-mode)
(setq display-time-day-and-date t)
(display-time-mode)


#+end_src
** Org mode
*** General configuration(s)
This is expected to grow over time
**** Org root directory
its best just to have a dedicated directory rather than throwing journa throwing
journal files wily nilly all over the home directory
#+begin_src emacs-lisp

(setq org-directory "~/org/")

#+end_src

**** Native theming for src blocks
#+begin_src emacs-lisp

(setq org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-confirm-babel-evaluate nil
      org-edit-src-content-indentation 0)

#+end_src

*** Org Journal

**** Org-Journal directory
I would like a directory just for journal entries, let keep everything nested in
directories, nice and tidy
#+begin_src emacs-lisp

(setq org-journal-dir "~/org/journal/")

#+end_src

**** Org-Journal File Format
I would like to have my journals sorted by year/month/day so I have this little
hack here that kind of works for now. There probably is a better solution but
I will stick to this for the time being
#+begin_src emacs-lisp

(setq org-journal-file-format "%Y/%m/%d.org")

#+end_src

*** Keybindings
**** Org Journal
This works better for me so I binded this to that
#+begin_src emacs-lisp

(map! :leader
      (:prefix ("j" ."Org Journal")
       :desc "new entry in org journal" "n" #'org-journal-new-entry
       :desc "open current journal file" "c" #'org-journal-open-current-journal-file
       ))

#+end_src


** Dired
*** Misc Dired Changes
**** Icons
Icons are nice, they liven up the place when used correctly
#+begin_src emacs-lisp

(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

#+end_src

**** Dired-Open
For when I am too lazy to exit emacs, my laptop's second os
#+begin_src emacs-lisp


(setq dired-open-extensions '(("gif" . "nsxiv")
			      ("jpg" . "nsxiv")
			      ("png" . "nsxiv")
			      ("mkv" . "mpv")
			      ("mp4" . "mpv")))

#+end_src
*** Ranger
**** Show hidden
#+begin_src emacs-lisp

(setq ranger-show-hidden "t")

#+end_src

*** Keybindings To Open Dired

| COMMAND    | DESCRIPTION                          | KEYBINDING |
|------------+--------------------------------------+------------|
| dired      | /Open dired file manager/            | SPC d d    |
| dired-jump | /Jump to current directory in dired/ | SPC d j    |

*** Basic dired commands

| COMMAND                | DESCRIPTION                                   | KEYBINDING |
|------------------------+-----------------------------------------------+------------|
| dired-view-file        | /View file in dired/                          | SPC d v    |
| dired-up-directory     | /Go up in directory tree/                     | h          |
| dired-find-file        | /Go down in directory tree (or open if file)/ | l          |
| dired-next-line        | Move down to next line                        | j          |
| dired-previous-line    | Move up to previous line                      | k          |
| dired-mark             | Mark file at point                            | m          |
| dired-unmark           | Unmark file at point                          | u          |
| dired-do-copy          | Copy current file or marked files             | C          |
| dired-do-rename        | Rename current file or marked files           | R          |
| dired-hide-details     | Toggle detailed listings on/off               | (          |
| dired-git-info-mode    | Toggle git information on/off                 | )          |
| dired-create-directory | Create new empty directory                    | +          |
| dired-diff             | Compare file at point with another            | =          |
| dired-subtree-toggle   | Toggle viewing subtree at point               | TAB        |

*** Dired commands using regex

| COMMAND                 | DESCRIPTION                | KEYBINDING |
|-------------------------+----------------------------+------------|
| dired-mark-files-regexp | Mark files using regex     | % m        |
| dired-do-copy-regexp    | Copy files using regex     | % C        |
| dired-do-rename-regexp  | Rename files using regex   | % R        |
| dired-mark-files-regexp | Mark all files using regex | * %        |

*** File permissions and ownership

| COMMAND         | DESCRIPTION                      | KEYBINDING |
|-----------------+----------------------------------+------------|
| dired-do-chgrp  | Change the group of marked files | g G        |
| dired-do-chmod  | Change the mode of marked files  | M          |
| dired-do-chown  | Change the owner of marked files | O          |
| dired-do-rename | Rename file or all marked files  | R          |
*** The Binds

#+begin_src emacs-lisp

(map! :leader
      (:prefix ("d" . "dired")
       :desc "Open dired" "d" #'dired
       :desc "Dired jump to current" "j" #'dired-jump
       :desc "Dired Ranger" "r" #'ranger
       :desc "Close dired ranger" "qr" #'ranger-close)
      (:after dired
              (:map dired-mode-map
               :desc "Peep-dired image previews" "d p" #'peep-dired
               :desc "Dired view file" "d v" #'dired-view-file)))
#+end_src

#+begin_src emacs-lisp

(evil-define-key 'normal dired-mode-map
  (kbd "M-RET") 'dired-display-file
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-open-file ; use dired-find-file instead of dired-open.
  (kbd "m") 'dired-mark
  (kbd "t") 'dired-toggle-marks
  (kbd "u") 'dired-unmark
  (kbd "C") 'dired-do-copy
  (kbd "D") 'dired-do-delete
  (kbd "J") 'dired-goto-file
  (kbd "M") 'dired-do-chmod
  (kbd "O") 'dired-do-chown
  (kbd "P") 'dired-do-print
  (kbd "R") 'dired-do-rename
  (kbd "T") 'dired-do-touch
  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
  (kbd "Z") 'dired-do-compress
  (kbd "+") 'dired-create-directory
  (kbd "-") 'dired-do-kill-lines
  (kbd "% l") 'dired-downcase
  (kbd "% m") 'dired-mark-files-regexp
  (kbd "% u") 'dired-upcase
  (kbd "* %") 'dired-mark-files-regexp
  (kbd "* .") 'dired-mark-extension
  (kbd "* /") 'dired-mark-directories
  (kbd "; d") 'epa-dired-do-decrypt
  (kbd "; e") 'epa-dired-do-encrypt)

#+end_src


** Lisp
*** Lisp compiler/interpreter
Sly [and for the times I use Slime] need to know what lisp
compiler/interpreter/implementation to use.
#+begin_src emacs-lisp

(setq inferior-lisp-program "sbcl")

#+end_src

*** Keybindings
**** General keybindings
Added a open prefix keybind because it felt right to put it under that prefix
#+begin_src emacs-lisp

(map! :leader
      (:prefix "o"
       :desc "open the common lisp repl" "l" #'sly))

#+end_src


** Email/Mu4e
*** Misc options
**** Mail user agent
Currently using MU4E for email, I just need to tell emacs that this is the case.
#+begin_src emacs-lisp

(setq mail-user-agent 'mu4e-user-agent)

#+end_src

**** Back end for mu4e
The imap backend I am currently using is mbsync,
it is a little faster than
#+begin_src emacs-lisp

(setq +mu4e-backend 'mbsync)

#+end_src

