config.el

(defun doom-dashboard-draw-ascii-emacs-banner-fn ()
  "This figlet font is called broadway"
  (let* ((banner
      '("                                                              .         .          "
        "888888888o.          ,o888888o.         ,o888888o.           ,8.       ,8.         "
        "8888    `^888.    . 8888     `88.    . 8888     `88.        ,888.     ,888.        "
        "8888        `88. ,8 8888       `8b  ,8 8888       `8b      .`8888.   .`8888.       "
        "8888         `88 88 8888        `8b 88 8888        `8b    ,8.`8888. ,8.`8888.      "
        "8888          88 88 8888         88 88 8888         88   ,8'8.`8888,8^8.`8888.     "
        "8888          88 88 8888         88 88 8888         88  ,8' `8.`8888' `8.`8888.    "
        "8888         ,88 88 8888        ,8P 88 8888        ,8P ,8'   `8.`88'   `8.`8888.   "
        "8888        ,88' `8 8888       ,8P  `8 8888       ,8P ,8'     `8.`'     `8.`8888.  "
        "8888    ,o88P'    ` 8888     ,88'    ` 8888     ,88' ,8'       `8        `8.`8888. "
        "888888888P'          `8888888P'         `8888888P'  ,8'         `         `8.`8888."
        "   _____________________________________________________________________________   "
        ".o8888888888888888888888888888888888888888888888888888888888888888888888888888888o."
        "                                                                                   "))

     (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
        +doom-dashboard--width
        (concat
         line (make-string (max 0 (- longest-line (length line)))
                   98)))
           "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'doom-dashboard-draw-ascii-emacs-banner-fn);)

(custom-set-faces!
  '(doom-dashboard-banner :foreground "#d79921" )
  '(doom-dashboard-footer :foreground "#b16286")
  '(doom-dashboard-footer-icon :foreground "#689d6a")
  '(doom-dashboard-loaded :foreground "#b8bb26")
  '(doom-dashboard-menu-desc :foreground "#83a598" )
  '(doom-dashboard-menu-title  :foreground "#fb4934")
  '(doom-modeline-time :foreground "#458588"))
(setq doom-gruvbox-dark-variant "medium")

(setq doom-font (font-spec :family "Fira Code" :size 14))
(setq doom-unicode-font (font-spec :family "Fira Code" :size 14))

(setq doom-theme 'doom-gruvbox)

(setq display-line-numbers-type t)

(setq doom-modeline-time t
      doom-modeline-height 11
      doom-modeline-buffer-name t
      doom-modeline--battery-status t)
(setq doom-modeline-enable-word-count t
      doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode))
(display-battery-mode)
(setq display-time-day-and-date t)
(display-time-mode)

(setq org-directory "~/org/")

(setq org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-confirm-babel-evaluate nil
      org-edit-src-content-indentation 0)

(setq org-journal-dir "~/org/journal/")

(setq org-journal-file-format "%Y/%m/%d.org")

(map! :leader
      (:prefix ("j" ."Org Journal")
       :desc "new entry in org journal" "n" #'org-journal-new-entry
       :desc "open current journal file" "c" #'org-journal-open-current-journal-file
       ))

(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

(setq dired-open-extensions '(("gif" . "nsxiv")
			      ("jpg" . "nsxiv")
			      ("png" . "nsxiv")
			      ("mkv" . "mpv")
			      ("mp4" . "mpv")))

(setq ranger-show-hidden "t")

(map! :leader
      (:prefix ("d" . "dired")
       :desc "Open dired" "d" #'dired
       :desc "Dired jump to current" "j" #'dired-jump
       :desc "Dired Ranger" "r" #'ranger
       :desc "Close dired ranger" "qr" #'ranger-close)
      (:after dired
              (:map dired-mode-map
               :desc "Peep-dired image previews" "d p" #'peep-dired
               :desc "Dired view file" "d v" #'dired-view-file)))

(evil-define-key 'normal dired-mode-map
  (kbd "M-RET") 'dired-display-file
  (kbd "h") 'dired-up-directory
  (kbd "l") 'dired-open-file ; use dired-find-file instead of dired-open.
  (kbd "m") 'dired-mark
  (kbd "t") 'dired-toggle-marks
  (kbd "u") 'dired-unmark
  (kbd "C") 'dired-do-copy
  (kbd "D") 'dired-do-delete
  (kbd "J") 'dired-goto-file
  (kbd "M") 'dired-do-chmod
  (kbd "O") 'dired-do-chown
  (kbd "P") 'dired-do-print
  (kbd "R") 'dired-do-rename
  (kbd "T") 'dired-do-touch
  (kbd "Y") 'dired-copy-filenamecopy-filename-as-kill ; copies filename to kill ring.
  (kbd "Z") 'dired-do-compress
  (kbd "+") 'dired-create-directory
  (kbd "-") 'dired-do-kill-lines
  (kbd "% l") 'dired-downcase
  (kbd "% m") 'dired-mark-files-regexp
  (kbd "% u") 'dired-upcase
  (kbd "* %") 'dired-mark-files-regexp
  (kbd "* .") 'dired-mark-extension
  (kbd "* /") 'dired-mark-directories
  (kbd "; d") 'epa-dired-do-decrypt
  (kbd "; e") 'epa-dired-do-encrypt)

(setq inferior-lisp-program "sbcl")

(map! :leader
      (:prefix "o"
       :desc "open the common lisp repl" "l" #'sly))

(setq mail-user-agent 'mu4e-user-agent)

(setq +mu4e-backend 'mbsync)
