config.org
**** Setting the root of the mail directory
The root mail dir is in /home/jy/Mail/
#+begin_src emacs-lisp

(setq mu4e-root-maildir "~/Mail/")

#+end_src

**** Keeps things from breaking when dealing with MX
#+begin_src emacs-lisp

(setq mu4e-change-filenames-when-moving t)

#+end_src

**** Don't allow to reply to self
Don't reply to your own email, thats silly
#+begin_src emacs-lisp

(setq mu4e-compose-dont-reply-to-self t)

#+end_src

**** kill the message when you exit the buffer of the composed email
I don't care about the message I am sending if I leave the buffer
#+begin_src emacs-lisp

(setq message-kill-buffer-on-exit t)

#+end_src
**** Maildir Shortcuts
#+begin_src emacs-lisp

	(setq mu4e-maildir-shortcuts
		  '( ("/yurek.me/Inbox" . ?i)
		 ("/yurek.me/Archive" . ?a)
		 ("/yurek.me/Drafts" . ?d)
		 ("/yurek.me/Deleted Items" . ?t)
		 ("/yurek.me/Sent Items" . ?s)
		 ;; Throwaway email for mailing lists
		 ;; It would be a horrible idea for me to subscribe to
		 ;; very active mailing lists for development on my
		 ;; domain email, so I will not
		 ("/gmail.com/All Mail" . ?1)
		 ("/gmail.com/Kernel" .?2)
		 ("/gmail.com/Kernel Newbies" . ?3)
		 ("/gmail.com/Emacs" . ?4)
		 ("/gmail.com/Arch" . ?5)
		 ("/gmail.com/Arch Commits" . ?6)
		 ("/gmail.com/Gentoo Dev" . ?7)
		 ("/gmail.com/TLDR" . ?8)
		 ))

#+end_src
*** Email accounts
**** Domain email
This is the only Microsoft exchange email that has ever worked with IMAP and
SMTP, its so weird
#+begin_src emacs-lisp

(set-email-account! "yurek.me"
		    '((user-mail-address      . "g3@yurek.me")
		      (user-full-name         . "Gerald Lee Yurek III")
		      (smtpmail-smtp-server   . "smtp.office365.com")
		      (smtpmail-smtp-service  . 587)
		      (smtpmail-stream-type   . starttls)
		      (smtpmail-debug-info    . t)
		      (mu4e-drafts-folder     . "/yurek.me/Drafts")
		      (mu4e-refile-folder     . "/yurek.me/Archive")
		      (mu4e-sent-folder       . "/yurek.me/Sent Items")
		      (mu4e-trash-folder      . "/yurek.me/Deleted Items")
		      (mu4e-update-interval   . 1800)
					;(mu4e-sent-messages-behavior . 'delete)
		      )
		    t )

#+end_src

**** Gmail/Mailing-list Email
This is my gmail account settings, its just for lurking in mailing lists
like the Linux kernel, emacs, arch Linux, gentoo.
#+begin_src  emacs-lisp

(set-email-account! "gmail.com"
		    '((user-mail-address      . "gly3mb@gmail.com")
		      (user-full-name         . "Gerald Lee Yurek III")
		      (smtpmail-smtp-server   . "smtp.gmail.com")
		      (smtpmail-smtp-service  . 587)
		      (smtpmail-stream-type   . starttls)
		      (smtpmail-debug-info    . t)
		      (mu4e-drafts-folder     . "/gmail.com/Drafts")
		      (mu4e-refile-folder     . "/gmail.com/Archive")
		      (mu4e-sent-folder       . "/gmail.com/Sent")
		      (mu4e-trash-folder      . "/gmail.com/Trash")
		      (mu4e-update-interval   . 1800)
					;(mu4e-sent-messages-behavior . 'delete)
		      )
		    t )

#+end_src

** Which Key
*** General Config
**** Change idle delay
#+begin_src emacs-lisp

(setq which-key-idle-delay 0.5)

#+end_src

** Elpher
*** Keybindings
**** General Keybinds
#+begin_src emacs-lisp

(map! :leader
      (:prefix "o"
       :desc "Open Elpher" "g" #'elpher)
      (:prefix ("e" . "Elpher")
       :desc "Open Elpher" "e" #'elpher
       :desc "Return to the start page" "U" #'elpher-back-to-start
       :desc "Go back" "u" #'elpher-back
       :desc "Download item under cursor" "d" #'elpher-download
       :desc "Download current page" "D" #'elpher-download-current
       :desc "Bookmark current page" "A" #'elpher-bookmark-current
       :desc "Bookmark item under cursor" "a" #'elpher-bookmark-link
       :desc "Bookmark list" "b" #'elpher-show-bookmarks
       ))

#+end_src
** Ligatures
#+begin_src emacs-lisp
;; Enable the www ligature in every possible major mode
;; (setq +ligatures-in-modes '(not comint-mode Info-mode elfeed-search-mode elfeed-show-mode))
;; (ligature-set-ligatures 't '("www"))

;; Enable ligatures in programming modes
(ligature-set-ligatures 't '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
                                     ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
                                     "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
                                     "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
                                     "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
                                     "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
                                     "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
                                     "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
                                     "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
                                     "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
;; (add-to-list 'ligature-composition-table '(("-" . ,() (rx (+ "-") ">"))))





(global-ligature-mode 't)
#+end_src


* Package.el
** Org Journal
This is for handling a journal, it makes it a lot easier than using my own
poorly written Emacs lisp.
#+begin_src emacs-lisp :tangle packages.el

(package! org-journal)

#+end_src


** Ligatures
Doom emacs doesn't correctly render ligatures, lets use this insead
#+begin_src emacs-lisp :tangle packages.el

(package! ligature)

#+end_src


** Dired Open
External file opener for dired
for things like media files (i.e. .mp4, .png, .jpg, .mkv)

#+begin_src emacs-lisp :tangle packages.el

(package! dired-open)

#+end_src


** Dired Subtree
#+begin_src emacs-lisp :tangle packages.el

(package! dired-subtree)

#+end_src


** Peep  Dired
A convenient way to look up file contents in other window while browsing
directory in dired
#+begin_src emacs-lisp :tangle packages.el

(package! peep-dired)

#+end_src


** Elpher

Gemini/Gopher browser for emacs, uses emacs' built-in bookmark system to
implement bookmarks for the browser
#+begin_src emacs-lisp :tangle packages.el

(package! elpher)

#+end_src


