config.el

(setq mu4e-root-maildir "~/Mail/")

(setq mu4e-change-filenames-when-moving t)

(setq mu4e-compose-dont-reply-to-self t)

(setq message-kill-buffer-on-exit t)

(setq mu4e-maildir-shortcuts
	  '( ("/yurek.me/Inbox" . ?i)
	 ("/yurek.me/Archive" . ?a)
	 ("/yurek.me/Drafts" . ?d)
	 ("/yurek.me/Deleted Items" . ?t)
	 ("/yurek.me/Sent Items" . ?s)
	 ;; Throwaway email for mailing lists
	 ;; It would be a horrible idea for me to subscribe to
	 ;; very active mailing lists for development on my
	 ;; domain email, so I will not
	 ("/gmail.com/All Mail" . ?1)
	 ("/gmail.com/Kernel" .?2)
	 ("/gmail.com/Kernel Newbies" . ?3)
	 ("/gmail.com/Emacs" . ?4)
	 ("/gmail.com/Arch" . ?5)
	 ("/gmail.com/Arch Commits" . ?6)
	 ("/gmail.com/Gentoo Dev" . ?7)
	 ("/gmail.com/TLDR" . ?8)
	 ))

(set-email-account! "yurek.me"
		    '((user-mail-address      . "g3@yurek.me")
		      (user-full-name         . "Gerald Lee Yurek III")
		      (smtpmail-smtp-server   . "smtp.office365.com")
		      (smtpmail-smtp-service  . 587)
		      (smtpmail-stream-type   . starttls)
		      (smtpmail-debug-info    . t)
		      (mu4e-drafts-folder     . "/yurek.me/Drafts")
		      (mu4e-refile-folder     . "/yurek.me/Archive")
		      (mu4e-sent-folder       . "/yurek.me/Sent Items")
		      (mu4e-trash-folder      . "/yurek.me/Deleted Items")
		      (mu4e-update-interval   . 1800)
					;(mu4e-sent-messages-behavior . 'delete)
		      )
		    t )

(set-email-account! "gmail.com"
		    '((user-mail-address      . "gly3mb@gmail.com")
		      (user-full-name         . "Gerald Lee Yurek III")
		      (smtpmail-smtp-server   . "smtp.gmail.com")
		      (smtpmail-smtp-service  . 587)
		      (smtpmail-stream-type   . starttls)
		      (smtpmail-debug-info    . t)
		      (mu4e-drafts-folder     . "/gmail.com/Drafts")
		      (mu4e-refile-folder     . "/gmail.com/Archive")
		      (mu4e-sent-folder       . "/gmail.com/Sent")
		      (mu4e-trash-folder      . "/gmail.com/Trash")
		      (mu4e-update-interval   . 1800)
					;(mu4e-sent-messages-behavior . 'delete)
		      )
		    t )

(setq which-key-idle-delay 0.5)

(map! :leader
      (:prefix "o"
       :desc "Open Elpher" "g" #'elpher)
      (:prefix ("e" . "Elpher")
       :desc "Open Elpher" "e" #'elpher
       :desc "Return to the start page" "U" #'elpher-back-to-start
       :desc "Go back" "u" #'elpher-back
       :desc "Download item under cursor" "d" #'elpher-download
       :desc "Download current page" "D" #'elpher-download-current
       :desc "Bookmark current page" "A" #'elpher-bookmark-current
       :desc "Bookmark item under cursor" "a" #'elpher-bookmark-link
       :desc "Bookmark list" "b" #'elpher-show-bookmarks
       ))

;; Enable the www ligature in every possible major mode
;; (setq +ligatures-in-modes '(not comint-mode Info-mode elfeed-search-mode elfeed-show-mode))
;; (ligature-set-ligatures 't '("www"))

;; Enable ligatures in programming modes
(ligature-set-ligatures 't '("www" "**" "***" "**/" "*>" "*/" "\\\\" "\\\\\\" "{-" "::"
                                     ":::" ":=" "!!" "!=" "!==" "-}" "----" "-->" "->" "->>"
                                     "-<" "-<<" "-~" "#{" "#[" "##" "###" "####" "#(" "#?" "#_"
                                     "#_(" ".-" ".=" ".." "..<" "..." "?=" "??" ";;" "/*" "/**"
                                     "/=" "/==" "/>" "//" "///" "&&" "||" "||=" "|=" "|>" "^=" "$>"
                                     "++" "+++" "+>" "=:=" "==" "===" "==>" "=>" "=>>" "<="
                                     "=<<" "=/=" ">-" ">=" ">=>" ">>" ">>-" ">>=" ">>>" "<*"
                                     "<*>" "<|" "<|>" "<$" "<$>" "<!--" "<-" "<--" "<->" "<+"
                                     "<+>" "<=" "<==" "<=>" "<=<" "<>" "<<" "<<-" "<<=" "<<<"
                                     "<~" "<~~" "</" "</>" "~@" "~-" "~>" "~~" "~~>" "%%"))
;; (add-to-list 'ligature-composition-table '(("-" . ,() (rx (+ "-") ">"))))





(global-ligature-mode 't)
